Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: དེ་དག་དེའི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ཞེས་བྱའོ།
en: Thus, they are called inappropriate thoughts.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་ཉན་ཐོས་དང་ལྡན་པའམ། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་གེགས་བྱེད་པ་ཡིན་ཏེ།
en: Venerable Pūrṇa, in the same way, when a bodhisattva seeks to awaken to unsurpassed and perfect buddhahood, any type of thinking associated with the hearers and solitary buddhas hinders the attainment of omniscience.

source: ཡིད་ལ་བྱེད་པ་དེ་དག་སྐྱེད་ན་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་རྣམས་ཀྱིས་ཟིལ་གྱིས་ནོན་པ་ཡིན་ནོ།
en: If such thoughts occur, the bodhisattva great being has become overpowered by the hearers.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་རྣམས་ཀྱིས་ཟིལ་གྱིས་ནོན་པ་ཡིན་ཏེ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, in that case the bodhisattva will have become overpowered by the hearers.

source: གང་ཉན་ཐོས་དང་ལྡན་པའམ། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་སྐྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་མི་བྱའོ།
en: Whoever thinks like a hearer or a solitary buddha does not deserve the name bodhisattva.

source: ཡིད་ལ་བྱེད་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་གྲངས་སུ་མི་ཆུད་པའི་ཕྱིར་རོ།
en: Because such thoughts do not occur in those we classify as bodhisattvas.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། རྒྱུན་དུ་ཞུགས་པ་ཉོན་མོངས་པ་ཀུན་ཏུ་སྤྱོད་ན་སྦྱིན་གནས་སུ་མི་འགྱུར་ཏེ།
en: Venerable Śāradvatīputra, for example, if a stream enterer entertains disturbing emotions, he is no longer a suitable recipient of generosity.

source: གལ་ཏེ་གང་གིས་དེའི་ཉོན་མོངས་པ་རྣམས་སྤོང་བའི་ཤེས་པ་ཐོབ་ན། དེས་དེ་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བྱ་བར་རབ་ཏུ་ཕྱེ་བ་ཡིན་གྱི།
en: If someone has attained the consciousness that abandons disturbing emotions, that person is recognized as a stream enterer.

source: ཉོན་མོངས་པ་རྣམས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་ཏེ།
en: However, if he has disturbing emotions, he is not recognized as such.

source: དེ་ལྟར་ན་ཤེས་པ་ཡོངས་སུ་ཤེས་པ་དང་། སྤོང་བ་ལ་འདྲིས་པས་དེ་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བྱའོ།
en: Therefore, a stream enterer is someone who has attained knowledge and become familiar with abandonment.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་ལྡན་པའམ། རང་སངས་རྒྱས་དང་ལྡན་པའི་སེམས་ཀུན་ཏུ་སྤྱོད་ཅིང་སྐྱེ་བས། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་གྱི།
en: Venerable Śāradvatīputra, likewise, if a bodhisattva arouses and entertains the mind state of a hearer or a solitary buddha, that person cannot be recognized as a bodhisattva.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་བརྩམས་པའི་སེམས་དང་སེམས་ལས་བྱུང་བ་གང་དག་ཡིན་པ་དེ་དག་སྐྱེ་བས། འདི་ལྟ་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བར་རབ་ཏུ་ཕྱེ་བ་ཡིན་ཏེ།
en: On the other hand, whoever keeps omniscience foremost in mind and engenders such mind states is recognized as a bodhisattva. “

source: བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་ན་ཚུགས་པར་མི་ནུས་སོ།
en: When bodhisattvas maintain the mind of awakening they cannot be harmed.

source: །ཚེ་དང་ལྡན་པ་དཔེར་ན། འཕོང་གི་སློབ་དཔོན་ནི་གནས་ན་འདུག་ཀྱང་རུང་། འགྲོ་ཡང་རུང་། དགྲ་རྣམས་ཀྱིས་ཚུགས་པར་དཀའ་བ་ཡིན་ཏེ། གཞན་གྱི་མདའ་ཡང་གཅོད་ཅིང་བདག་ཀྱང་སྲུང་ངོ་།
en: Venerable One, to give an analogy, regardless of whether a master archer sits or moves about, it will be hard for his enemies to harm him, since he can intercept the arrows of others and protect himself.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་པ་ཡང་ཚུགས་པར་དཀའོ།
en: Venerable Śāradvatīputra, likewise, when bodhisattvas maintain the mind of awakening, it is difficult to harm them.

source: །ཉན་ཐོས་ཀྱི་སྤྱོད་པའམ། རང་སངས་རྒྱས་ཀྱི་སྤྱོད་པ་ཐོས་ན་ཡང་འདི་ལྟར་བདག་ཀྱང་མྱུར་བ་ཉིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ད་ལྟར་ཉན་ཐོས་རྣམས་ལ་ཆོས་སྟོན་པ་དེ་བཞིན་དུ། བདག་ཀྱང་ཉན་ཐོས་རྣམས་ལ་ཆོས་སྟོན་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་སྔོ་བར་བྱེད་དོ།
en: Even if they should hear of the activities of hearers and solitary buddhas, they will form the aspiration, ‘May I swiftly awaken to unsurpassed and perfect buddhahood and teach the Dharma to the hearers, just as the thus-gone, worthy, perfect Buddha Śākyamuni is teaching the Dharma to the hearers at present.’

source: །ཚེ་དང་ལྡན་པ་དེ་ལྟར་ན་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་པ་ལ་ཚུགས་པར་མི་ནུས་ཏེ།
en: Venerable One, in this way skillful bodhisattvas who maintain the mind of awakening cannot be harmed.

source: ཉན་ཐོས་ཀྱི་གཏམ་མམ། རང་སངས་རྒྱས་ཀྱི་གཏམ་ཐོས་ན་ཡང་། ཆོས་ཀྱི་གཏམ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ལས་བྱུང་ངོ་ཞེས་དེ་བཞིན་གཤེགས་པ་དྲན་པར་བྱེད་དེ། ཉན་ཐོས་རྣམས་ལ་ཆགས་པ་མི་སྐྱེད་དོ།
en: Even if they hear the instructions of the hearers and solitary buddhas, they will think, ‘These Dharma instructions appeared from the Thus-Gone One.’ In this way they will bring the Thus-Gone One to mind without developing any attachment to the vehicle of the hearers.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་པ་ནི་ཐུབ་པར་དཀའ་བ་ཡིན་ནོ།
en: Venerable Śāradvatīputra, it is therefore hard to match bodhisattvas who maintain the mind of awakening.

source: །ཚེ་དང་ལྡན་པ་དཔེར་ན། རྣལ་འབྱོར་པ་རྣལ་འབྱོར་སྤྱོད་པ་དམིགས་པ་ཐོབ་ཅིང་། ཏིང་ངེ་འཛིན་ལེགས་པར་བསྒོམས་པའི་ཕྱིར་རྣམ་པར་རྟོག་པ་རྣམས་ཀྱིས་མི་ཚུགས་སོ།
en: Similarly, Venerable One, for example, when practitioners become focused in spiritual practice and well trained in absorption, thoughts are no longer able to harm them.

source: འདི་ལྟར་དམིགས་པ་དེ་ལ་རབ་ཏུ་གོམས་པའི་ཕྱིར་རོ།
en: Because they have become greatly familiar with that focus.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་པ་ཡང་ཐུབ་པར་དཀའོ།
en: Likewise, it is hard to match bodhisattvas who maintain the mind of awakening.

source: འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མི་འབྲལ་བའི་ཕྱིར་རོ། །
en: Because they are never apart from the mind of omniscience.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐུབ་པར་དཀའ་བར་རིག་པར་བྱ་ན། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་གང་དག་ཡིན་པ་རྣམས་དང་། ཕྱིར་མི་ལྡོག་པ་གང་དག་ཡིན་པ་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་གང་དག་ཡིན་པ་ཐམས་ཅད་དམ།
en: Śāradvatīputra said, “Venerable Pūrṇa, if it should be understood that it is hard to match bodhisattvas, does that refer to all bodhisattvas, including those who have newly entered this vehicle, those who have become nonregressing, and those who sit at the seat of awakening?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་ཐུབ་པར་དཀའ་བ་ཡིན་ནོ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, yes, all of those bodhisattvas are hard to match.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དམ་བཅས་པ་ལས་བསྐྱོད་མི་ནུས་ཏེ།
en: Because those bodhisattvas cannot be swayed from their vows.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དམ་བཅས་པ་ལ་གནས་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལ་གནས་པ་དེ་དག་ནི་ཐམས་ཅད་ཀྱང་ཐུབ་པར་དཀའ་བ་ཡིན་ནོ།
en: And therefore, all those bodhisattvas who keep their vows and maintain the mind of awakening are hard to match.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། བྱང་ཆུབ་སེམས་དཔའ་ད་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལོ་བྱེ་བ་བརྒྱ་ཕྲག་མང་པོ་ནས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། བཞུགས་ཤིང་གཞེས་པ་གང་ཡིན་པ་དེ་གཉི་ག་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: Venerable Śāradvatīputra, for example, those bodhisattvas who awaken at present and those thus-gone ones who awaken one billion years from now are equally omniscient.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐ་མའི་སེམས་ཐོབ་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ནི་འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་རྣམས་ཀྱིས་མཉམ་མོ། །
en: Venerable Śāradvatīputra, in the same way, those bodhisattvas who have newly entered this vehicle, those bodhisattvas who have become nonregressing, and those bodhisattvas who attain the final state of mind as they are sitting at the seat of awakening are all equal in terms of focusing on the state of omniscience.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་འདི་དག་ཇི་ལྟར་ཁྱད་པར་མེད།
en: Śāradvatīputra said, “Venerable Pūrṇa, how is it they are not different?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་ནི་ཁྱད་པར་མེད་དེ། འོན་ཀྱང་མགྱོགས་བུལ་གྱིས་ནི་ཁྱད་པར་ཡོད་དོ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, although there is a difference in terms of the speed of their progress, there is no difference with regard to the mind of awakening itself.

source: །སེམས་དེ་གཉི་ག་ནི་མཉམ་སྟེ། གང་ཞེ་ན། བྱང་ཆུབ་ཏུ་མངོན་པར་སྒྲུབ་པ་གང་དག་ཡིན་པ་རྣམས་སོ།
en: As such, all of these types of mind are equal with regard to accomplishing awakening.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ལ་གནས་པ་ནི་ཕྱིར་མི་ལྡོག་གོ། །དགྲ་བཅོམ་པ་གང་དགྲ་བཅོམ་པ་ཉིད་ལས་ལྡོག་ལ།
en: Venerable Śāradvatīputra, they are nonregressing from abiding in the mind of a bodhisattva.

source: ཟག་པ་མེད་པའི་སེམས་ལས་ཀྱང་ལྡོག་ན། དེ་དགྲ་བཅོམ་པ་ཉིད་དུ་རིག་པར་བྱའམ།
en: Now tell me, could someone who has strayed from the state of a worthy one and maintains a defiled state of mind be considered a worthy one?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ནི་མ་ཡིན་ཏེ། དེ་ནི་ལྷག་པའི་ང་རྒྱལ་ཅན་ཡིན་པར་རིག་པར་བྱའོ། །
en: Śāradvatīputra said, “No, Venerable Pūrṇa, one would be very arrogant to say so.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ལས་ཕྱིར་ལྡོག་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་ཏུ་ཁས་འཆེ་བར་ཟད་དེ།
en: Pūrṇa said, “Venerable Śāradvatīputra, likewise, it would be pretentious for a bodhisattva who leaves behind the mind of awakening to claim to be awakened.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན་གྱི། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སུན་འབྱིན་པ་ཡིན་ཏེ།
en: Such a person is no longer a bodhisattva, but rather a defamed bodhisattva.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བར་རིག་པར་བྱ་བ་མ་ཡིན་ནོ།
en: That person can no longer be called a bodhisattva.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་དེ་དེ་བཞིན་ནོ།
en: Śāradvatīputra said, “Venerable Pūrṇa, that is correct.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ཞིག་ཕོ་མཚན་དང་ལྡན་པར་གྱུར་ཏེ། དབང་པོ་མ་ཚང་བ་མ་ཡིན་པ་ལས། ཕྱིས་དེའི་ཕོ་མཚན་མེད་པར་གྱུར་ལ། ཕོ་མཚན་གྱི་བྱ་བ་བྱེད་མི་ནུས་ན། དེ་ནི་མ་ནིང་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ། །
en: Venerable Pūrṇa, as an analogy, if a man at first has a functioning sex organ but later loses that organ, so that he becomes unable to act with a functioning male sex organ, that person is classified as a neuter.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའི་སེམས་རྨུག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་གྲངས་སུ་མི་འགྲོའོ།
en: Venerable Pūrṇa, in the same way, if the mind of bodhisattvas becomes sluggish, they can no longer be classified as bodhisattvas.”

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་སྦྱང་བར་བྱ་བའི་ལེའུ་སྟེ་བརྒྱད་པའོ།། །།
en: This concludes the eighth chapter from “The Perfection of Generosity” entitled “Engaging in Bodhisattva Training.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཡིད་ལ་བྱེད་པ་ཇི་ལྟ་བུ་བསྐྱེད་པར་བྱའི།
en: Maitrāyaṇīputra asked Venerable Śāradvatīputra, “Venerable Śāradvatīputra, when bodhisattvas wish to awaken to unsurpassed and perfect buddhahood, what kind of mindset should they engender?”

source: སྨྲས་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་བསྐྱེད་པར་བྱའོ།
en: Śāradvatīputra said, “They should develop a mindset intent on the state of omniscience.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ལ་གནས་པ་ཡིན་ནོ།
en: In this way bodhisattvas will practice the bodhisattva teachings.

source: །དེ་ལྟར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱིན་པ་གང་དང་གང་སྦྱིན་པ་དེ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་དོ།
en: Bodhisattvas who practice in this manner will dedicate any form of generosity toward the state of omniscience.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་ན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ། །
en: If they dedicate toward the state of omniscience, they are embracing the perfection of generosity.

source: གལ་ཏེ་དེ་ལྟར་ཡོངས་སུ་སྔོ་བར་མི་བྱེད་ན། དེ་ནི་སྦྱིན་པ་ཡིན་གྱི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཡིན་ནོ། །
en: However, if they do not dedicate in that manner, they may be generous, but it will not be the perfection of generosity. “

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་སྦྱིན་པ་སྦྱིན་པ་ན་རྣམ་པར་རྟོག་སྟེ། བདག་གིས་ཅུང་ཟད་ནི་ཡོངས་སུ་བཏང་ལ་ཅུང་ཟད་ནི་ཡོངས་སུ་མ་བཏང་ངོ་ཞེས་རྣམ་པར་རྟོག་པར་བྱེད་ཅིང་འདི་ནི་བདག་གིས་སྦྱིན་པར་བྱ། འདི་ནི་སྦྱིན་པར་མི་བྱའོ། །འདི་ལ་ནི་སྦྱིན། འདི་ལ་ནི་མི་སྦྱིན་ནོ་ཞེས་རྣམ་པར་རྟོག་པར་བྱེད་དེ། ངན་པ་ནི་སྦྱིན་པར་བྱ། བཟང་པོ་ནི་སྦྱིན་པར་མི་བྱ། ཚུལ་ཁྲིམས་ཅན་ལ་ནི་སྦྱིན་པར་བྱ། ཚུལ་ཁྲིམས་འཆལ་པ་ལ་ནི་སྦྱིན་པར་མི་བྱའོ་ཞེས་རྣམ་པར་རྟོག་པར་བྱེད་ན།
en: Moreover, Venerable Pūrṇa, bodhisattvas who are practicing generosity might think, ‘I will give some, but not all,’ or, ‘I should give this, but not that,’ or, ‘I will give to this one, but not to that one,’ or, ‘I should give what is inferior, but not what is excellent,’ or, ‘I will give to those who maintain their discipline, but not to those who don’t.’

source: རྣམ་པར་རྟོག་པ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བར་ཆད་བྱེད་པ་ཡིན་ནོ།
en: If bodhisattvas think like that, it will create obstacles for their attainment of omniscience.

source: །དེ་ལྟར་རྣམ་པར་རྟོག་པ་ནི་ཡུན་རིང་མོ་ཞིག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ། །བདག་ཡུན་རིང་མོ་ཞིག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་གྲང་ཞེས་རྣམ་པར་རྟོག་པར་མི་བྱའོ།
en: Likewise, they should not think, ‘Omniscience is only attained after a very long time; it will be so long before I will attain omniscience.’

source: །ཐམས་ཅད་ལ་མཉམ་པར་གཏོང་ཞིང་སེམས་མཉམ་པ་ནི་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: It is by giving evenly to everyone with an impartial attitude that they swiftly attain the state of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་དེ་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་བྱའོ། །
en: Venerable Pūrṇa, if bodhisattvas wish to awaken to unsurpassed and perfect buddhahood, that is how they should practice generosity.

source: སྦྱིན་པ་ཟིལ་གྱིས་མནན་ཏེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ནི་གལ་ཏེ།
en: They should go beyond common generosity and complete the perfection of generosity.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་ཟན་བྱིན་ལ། ཟན་ཟོས་པའི་འོག་ཏུ་སེམས་ཅན་དེ་དག་ལ་གསེར་གྱི་དོང་ཙེ་དང་། རས་བཅོས་བུ་ཟུང་དང་། གསེར་ཐགས་ཅན་གྱི་རས་བྱིན་ལ།
en: Imagine bodhisattvas who might feed as many beings as there are grains of sand in the Ganges and, after they have enjoyed their meal, distribute golden coins to them along with clothes to wear and fabrics made of golden threads.

source: དེ་བཞིན་དུ་ཉི་མ་གུང་དང་། ཕྱེ་མ་རེད་དང་། དེ་བཞིན་དུ་མཚན་མོ་ནམ་གྱི་ཆ་སྟོད་དང་། དེ་བཞིན་དུ་ནམ་གྱི་གུང་དང་། དེ་བཞིན་དུ་ནམ་གྱི་ཆ་སྨད་ཀྱི་ཐུན་ལ།
en: They may do so in the morning and then repeat this action at noon, in the afternoon, in the evening, at midnight, and also late in the night.

source: སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་ཟན་བྱིན་ལ། དེ་བཞིན་དུ་སྦྱིན་པ་ཡང་བྱིན་ཏེ། བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཤིང་།
en: And during all these times they may feed as many beings as there are grains of sand in the Ganges and shower them with gifts, continuing with their act of generosity in this way for as many eons as there are grains of sand in the Ganges.

source: དེ་བཞིན་དུ་ཡོངས་སུ་གཏོང་ཡང་ཇི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་བྱ་བ་མི་ཤེས་ན། དེ་ནི་སྦྱིན་པ་ཡིན་གྱི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: Still, unless they know how to dedicate the merit toward the state of omniscience, they may be generous, but they will not be practicing the perfection of generosity.

source: །ཇི་སྟེ་ཡོངས་སུ་བསྔོ་བ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ།
en: On the other hand, if they know how to dedicate the merit in this way, bodhisattvas can take hold of the perfection of generosity. “

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐད་ན་མང་དུ་ཡོངས་སུ་གཏོང་བ་མ་ཡིན་ནོ།
en: As bodhisattvas, they should not just give a lot to those around them.

source: འདི་ལྟར་དེ་ཆོས་ཚད་མེད་པའི་ཆོས་ཐོབ་པར་འདོད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱང་ཐོབ་པར་འདོད་ན། ཚད་དང་ལྡན་པའི་ཡོངས་སུ་གཏོང་བས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་ནུས་པའི་ཕྱིར་རོ།
en: Because if they are hoping to attain limitless qualities as well as the qualities of the bodhisattvas, a limited act of giving will be unable to bring about omniscience.

source: །གལ་ཏེ་སྦྱིན་པ་དེ་ཚད་ངེས་པར་གྱུར་ན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཡིན་གྱི།
en: If their generosity is limited, it cannot be the perfection of generosity.

source: གང་གི་ཕྱིར་སྦྱིན་པ་དེ་ཚད་ངེས་པ་མ་ཡིན་པ་དེའི་ཕྱིར། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་འགྱུར་རོ།
en: However, if their generosity is boundless, it becomes the perfection of generosity.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཚད་ངེས་པ་མ་ཡིན་པའི་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: Venerable Pūrṇa, in this way bodhisattva great beings should practice generosity that knows no bounds.

source: །དེ་ནས་ཕྱིས་ཀྱང་ཡོངས་སུ་གཏང་བར་བྱའོ་ཞེས་དེ་ལྟར་ཡོངས་སུ་གཏང་བར་བྱ་སྟེ།
en: And they should give while thinking that they will do so again and again.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐབས་དེས་ན། སེར་སྣ་ཚར་གཅོད་ཅིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་འཛིན་ཏོ།
en: By means of this method, bodhisattvas will eradicate miserliness and take hold of omniscience.

source: །དེ་ཡང་འདི་ལྟར་བདག་གིས་སྦྱིན་པ་དཔག་ཏུ་མེད་པ་སྦྱིན་པར་བྱ་སྟེ། གང་གི་ཚེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་གྱི་བར་དུ་སྦྱིན་པར་བྱའོ།
en: For that, they should think to themselves, ‘I will practice generosity in a boundless manner until I awaken to unsurpassed and perfect buddhahood.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཟང་ཟིང་མེད་པའི་ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པར་བྱའོ།
en: When I awaken to unsurpassed and perfect buddhahood, I will benefit other beings with the gift of the Dharma that is beyond worldly goods.

source: །ད་ལྟར་ནི་ཇི་སྲིད་དུ་བྱང་ཆུབ་ཏུ་སྤྱོད་པའི་བར་དུ་ཟང་ཟིང་གིས་ཕན་གདགས་པར་བྱའོ།
en: Right now, and until I attain awakening, I will benefit them with material gifts.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན་ནི། ཟང་ཟིང་མེད་པའི་ཆོས་ཀྱི་སྦྱིན་པས། སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པར་བྱའོ་སྙམ་དུ་སེམས་སྐྱེད་དོ།
en: However, when I awaken to unsurpassed and perfect buddhahood, I shall benefit others with the gift of the Dharma that is beyond worldly goods.’ “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ཞིག་རྒྱལ་པོ་ལ་སྟེན་ཏེ།
en: Venerable Pūrṇa, as an analogy, consider a servant of a king.

source: དེ་རྒྱལ་པོ་ལ་སྟེན་ཅིང་འཁོར་ལ་བསྙེན་བཀུར་བྱས་པས།
en: He may attend on the king and offer his service.

source: རྒྱལ་པོ་དེས་དེ་ལ་ཟན་སྦྱིན་ཞིང་། དེས་ཟང་ཟིང་གི་སྦྱིན་པས་ཕན་འདོགས་ཏེ།
en: In return the king offers him meals and worldly gifts.

source: དེས་བསྟེན་ཅིང་བསྐོར་ཏེ། བསྙེན་བཀུར་བྱས་པས་རྒྱལ་པོ་མཉེས་ཤིང་དགྱེས་པར་གྱུར་ནས། རིན་པོ་ཆེ་བརྒྱ་སྟོང་དུ་མ་བསྐོན་པ་དེ་བཞིན་དུ།
en: As the servant attends on the king and offers his service, the king may be pleased with his service and offer him many hundreds of thousands of gemstones.

source: ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཀྱང་། བྱང་ཆུབ་ཏུ་སྤྱོད་པ་ན། སེམས་ཅན་དཔག་ཏུ་མེད་པ་ལ་ཟང་ཟིང་གི་སྦྱིན་པས་ཕན་འདོགས་ཤིང་།
en: Venerable Pūrṇa, likewise, bodhisattvas wish to awaken to unsurpassed and perfect buddhahood and, in their attempt to make that happen, benefit limitless beings by offering them worldly goods.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། ཟང་ཟིང་མེད་པའི་ཆོས་ཀྱི་སྦྱིན་པས། སེམས་ཅན་རྣམས་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: As they awaken to unsurpassed and perfect buddhahood, they will guide and teach others by means of the gift of the Dharma that is beyond worldly goods.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་འཁོར་བའི་སྡུག་བསྔལ་རྣམས་ལས་གྲོལ་བར་བྱེད་དོ།
en: In this way they will liberate countless beings from the sufferings of cyclic existence. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། རྒྱལ་པོའི་བུ་ཞིག་ཡོད་ལ།
en: Venerable Pūrṇa, consider, as a further analogy, a royal prince.

source: མི་མང་པོ་གང་དག་གིས་རྒྱལ་པོའི་བུ་དེ་ལ་སྟེན་ཅིང་བསྐོར་ཏེ།
en: There may be many people who attend upon and serve such a prince.

source: བསྙེན་བཀུར་བྱེད་ན། རྒྱལ་པོའི་བུ་དེས་བསྟེན་པའི་མི་དེ་དག་ཐམས་ཅད་ལ་ཁ་ཟས་གཡོས་པས་ཕན་འདོགས་པར་བྱེད་དེ།
en: If he is pleased with their service, the prince may help them in return by having food prepared for them.

source: ཇི་ཙམ་ན་རྒྱལ་པོའི་བུ་དེ་རྒྱལ་སྲིད་ལ་གནས་པའི་དུས་ལ་བབ་སྟེ། རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་ཞིང་། རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ཐོབ་པའི་ཚེ།
en: One day the time will arrive for the prince to take over the kingdom and he will be anointed as the leader of the country.

source: དེའི་མི་ཞབས་འབྲིང་རྙིང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ལ། འདི་དག་ནི་བདག་གཞོན་ནུའི་ས་ལ་གནས་པ་ན།
en: At that point he will look at his old servants, thinking, ‘These people stayed by me when I was a prince.

source: བདག་གིས་སྦྱངས་ཤིང་བདག་གིར་བྱས་པ་ཡིན།
en: At that time, I trained them and cared for them.

source: བདག་ཀྱང་འདི་དག་གིས་སྦྱངས་ཤིང་བདག་གིར་བྱས་པ་ཡིན་གྱིས།
en: But they also trained me and cared for me.

source: བདག་གིས་མི་འདི་དག་ལོངས་སྤྱོད་ལ་ཅི་རིགས་པར་དགོད་དོ་སྙམ་སྟེ།
en: So now I should grant them all types of benefits.

source: དེས་བདག་གིས་འཁོར་རྣམས་ཁ་ཅིག་ནི་གྲོང་ཁྱེར་དག་ཏུ་སྣ་བོར་བཅུག །ཁ་ཅིག་ནི་ལས་ཀྱི་སྣ་དག་ཏུ། ཁ་ཅིག་ནི་ཚོང་འདུས་དག་ཏུ། ཁ་ཅིག་ནི་འོར་གྱི་གྲོང་དག་ཏུ་བསྐོས། ཁ་ཅིག་ལ་ནི་གྲོང་དམ་པ་ལོངས་སྤྱོད་དུ་བྱིན་ནོ། །
en: I will install some of my servants as heads of villages, others as foremen, market managers, and city elders, and other in high posts in the villages.’ “

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཀྱང་། བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་ལ་ཕན་འདོགས་ཏེ། ཟང་ཟིང་གི་སྦྱིན་པ་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། སྟན་དང་། ནད་གསོས་དང་། སྨན་ཟོང་དག་གིས་ཕན་འདོགས་ཏེ།
en: Venerable Pūrṇa, in the same way, bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood benefit countless beings as they strive to attain awakening, showering them with worldly gifts such as clothes, food, bedding, mats, medicine, and medicaments.

source: ཇི་ལྟར་རྒྱལ་པོ་གཞོན་ནུ་དེས་འཁོར་དེ་དག་ཁ་ཟས་གཡོས་པ་དང་། བཟའ་བ་དང་། བཅའ་བ་ཅི་འབྱོར་པ་དག་གིས་ཕན་འདོགས་པ་དེ་བཞིན་དུ། ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པས་ཀྱང་། སེམས་ཅན་རྣམས་ལ་ཟང་ཟིང་གི་སྦྱིན་པས་ཕན་འདོགས་ཤིང་།
en: Just as the prince satisfied the needs of his servants by giving them food and drinks, so, Venerable Pūrṇa, do bodhisattvas engage in bodhisattva activity, thereby benefiting others with the gift of worldly goods.

source: གང་གི་ཚེ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏེ། བདུད་རྩིའི་དབང་བསྐུར་བ་ཐོབ་པ་ན། བློ་ཇི་ལྟ་བ་དང་། ཤེས་རབ་ཇི་ལྟ་བ་བཞིན་དུ་ཟང་ཟིང་མེད་པའི་ཆོས་ཀྱི་སྦྱིན་པས་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏོ། །
en: As they awaken to unsurpassed and perfect buddhahood and receive the anointment of nectar, they offer counsel and teachings by means of the gift of the Dharma, which is beyond worldly goods, according to the inclinations and intelligence of the listeners.
